{
  "TITLE": "Elektroniikan perusteet - Lukumateriaali",
  "ORDER": 1,
  "isReadingMaterial": true,
  "content": [
    {
      "title": "1. Sähköpiirin peruskomponentit",
      "image": "./images/1.png",
      "text": "Yksinkertaisessa sähköpiirissä virtaa kuljettaa jännitelähde (kuten paristo), joka pumppaa elektroneja piirin läpi. Vesianalogian mukaan jännitelähde toimii kuin vesipumppu, joka nostaa vettä korkeammalle. Energia mitataan e.m.f:n (electromotive force) avulla, joka kuvaa energian määrää per varausyksikkö."
    },
    {
      "title": "2. Jännitteen merkintätavat",
      "image": "./images/2.png",
      "text": "Jännite merkitään piirikaavioihin nuolella, joka osoittaa suunnan pään ja hännän välillä. Jännitemerkinnät esitetään aina maahan (earth) nähden, mikä on nolla-volttiviite. Kuvassa näkyy, kuinka eri pisteet piirissä voivat olla eri potentiaaleissa, mutta samalla tasolla olevat pisteet ovat samassa potentiaalissa."
    },
    {
      "title": "3. Ground-referenssi ja potentiaalit",
      "image": "./images/3.png",
      "text": "Jännitteet mitataan aina johonkin referenssipisteeseen nähden. Yleisin nolla-voltin referenssipiste on 'ground' tai 'earth' (maa), jota merkitään erityisellä ground-symbolilla. Tämä symboli näkyy kuvassa oikeassa alakulmassa, ja se auttaa piirikaavioissa selkeyttämään referenssipistettä."
    },
    {
      "title": "4. Piirikomponentit ja niiden funktiot",
      "image": "./images/4.png",
      "text": "Sähköpiirissä on erilaisia komponentteja, joilla on omat tehtävänsä. Kondensaattorit (capacitors) varastoivat energiaa sähkökenttään, kun taas kelat (inductors) varastoivat energiaa magneettikenttään. Resistorit vastustavat sähkövirran kulkua ja muuttavat sähköenergiaa lämmöksi. Muuttuvia resistoreita voidaan käyttää piirin vastuksen säätämiseen."
    },
    {
      "title": "5. Jännitemerkintöjen soveltaminen",
      "image": "./images/5.png",
      "text": "Jännitteen suuntaa merkitsevät nuolet kertovat, kuinka jännite mitataan. Kuvassa näkyy, kuinka eri resistoreiden ylissä olevat jännitteet (VB, VC) edustavat kyseisen komponentin pään jännitettä häntään nähden. Kaikki jännitemerkinnät esitetään suhteessa maahan."
    },
    {
      "title": "6. Resistorien sarjaan- ja rinnankytketyt",
      "image": "./images/6.png",
      "text": "Resistoreita voidaan kytkeä kahdella tavalla. Sarjakytkennässä kokonaisvastus kasvaa (R_tot = R1 + R2 + ...), ja sama virta kulkee kaikkien komponenttien läpi. Rinnankytketyssä piirissä kokonaisvastus pienenee ja lasketaan käänteisarvojen summan käänteisluvuna (1/R_tot = 1/R1 + 1/R2 + ...). Rinnankytketyssä piirissä jännite on sama kaikilla komponenteilla."
    },
    {
      "title": "7. Ohmin laki",
      "image": "./images/7.png",
      "text": "Ohmin laki on yksi tärkeimmistä sähkötekniikan peruslaeista: V = I × R. Jännite (V) on virran (I) ja vastuksen (R) tulo. Tämä yhtälö voidaan järjestää myös muotoihin I = V / R ja R = V / I. Esimerkiksi: jos jännite on 12V ja vastus 4Ω, virta on 3A; jos vastus on 10Ω ja virta 2A, jännite on 20V."
    },
    {
      "title": "8. Johdanto perusperiaatteisiin",
      "image": "./images/8.png",
      "text": "Tämä luku toimii kertauksena sähköpiirien perusteista ja luo pohjaa syvemmälle oppimiselle. Täällä opimme tärkeimmät käsitteet ja periaatteet, joita käytämme myöhemmin elektronisten piirien suunnittelussa."
    },
    {
      "title": "9. Kapasitanssi ja sen yksikkö",
      "image": "./images/9.png",
      "text": "Kapasitanssi kuvaa komponentin kykyä varastoida sähköä. Kapasitanssin SI-yksikkö on faradi (F). Kondensaattorin kapasitanssi kertoo, kuinka paljon varausta se voi varastoida tietyllä jännitteellä. Suurempi kapasitanssi tarkoittaa suurempaa varausvarastointikykyä."
    },
    {
      "title": "10. SI-etuliitteet",
      "image": "./images/10.png",
      "text": "Sähkötekniikassa käytetään SI-etuliitteitä suurten ja pienten lukujen esittämiseen. Giga (G) tarkoittaa 10^9, mega (M) tarkoittaa 10^6, kilo (k) tarkoittaa 10^3, milli (m) tarkoittaa 10^-3, ja mikro (μ) tarkoittaa 10^-6. Näiden kanssa säästyy kirjoitustyötä ja tekemisestä tulee selkeämpää."
    },
    {
      "title": "11. Virtapiiri ja sen ehdot",
      "image": "./images/11.png",
      "text": "Jatkuva virta virtapiirissä vaatii kaksi asiaa: suljetun virtapiirin ja energialähteen. Pelkkä vastus ei aiheuta virtaa ilman energialähdettä. Johdinten pituus tai kondensaattorin varaus yksinään eivät riitä jatkuvan virran ylläpitoon."
    },
    {
      "title": "12. Elektromotorinen voima (e.m.f.)",
      "image": "./images/12.png",
      "text": "E.m.f. (electromotive force) edustaa energian lisäystä piirissä – se on jännitelähteen tuottaman energian mitta per varausyksikkö. E.m.f. on eri asia kuin vastuksen aiheuttama häviö tai johdinten lämpötila. Se on puhtaasti energialähteen ominaisuus."
    },
    {
      "title": "13. Virtapiirin vaatimukset",
      "image": "./images/13.png",
      "text": "Jotta virta voisi kulkea jatkuvasti piirissä, tarvitaan kaksi tekijää: suljettu piiri ja potentiaaliero (jännite). Pelkkä suuri resistanssi tai ainoastaan kondensaattori eivät riitä, vaan tarvitaan aktiivinen energialähde, joka ylläpitää potentiaalieroa."
    },
    {
      "title": "14. Jännitemittaus piirissä",
      "image": "./images/14.png",
      "text": "Sähköpiireissä jännitteet mitataan yleensä maahan/earth-referenssiin nähden. Satunnaiseen pisteeseen mittaaminen voi tuottaa sekavia tuloksia. Tämän takia on tärkeä valita selkeä referenssipiste (yleensä maadoitus) ennen mittaamista."
    },
    {
      "title": "15. Jännitemerkit ja suunta",
      "image": "./images/15.png",
      "text": "Jännitemerkintöjen nuoli kuvaa pään jännitettä häntään nähden. Se on tavalla, jonka valitsemme esittää jännitteen suunnan piirissä. Tämä merkintätapa auttaa välttämään sekavuutta monimutkaisisissa piireissä ja tekee laskelmista yhdenmukaisempia."
    },
    {
      "title": "16. Vaihtovirta (AC) ja tasavirta (DC)",
      "image": "./images/16.png",
      "text": "Tasavirta (DC) kulkee aina samaan suuntaan, kun taas vaihtovirta (AC) vaihtaa suuntaa jaksollisesti. AC-virran etuja ovat pitkien matkojen tehokas siirto, kun taas DC-virtaa käytetään usein akkujen ja elektronisten laitteiden kanssa. Molemmat tarvitsevat jännitelähdettä toimiakseen."
    },
    {
      "title": "17. Energia kondensaattorissa",
      "image": "./images/17.png",
      "text": "Kondensaattori varastoi energiaa sähkökenttään, ei magneettikenttään, lämpöön tai mekaaniseen energiaan. Kondensaattorin energia voidaan muuntaa takaisin sähköenergiaksi, kun se purkaantuu. Tämä tekee kondensaattoreista hyödyllisiä energian välivarastoina sovelluksissa."
    },
    {
      "title": "18. Ohmin lain soveltaminen",
      "image": "./images/18.png",
      "text": "Ohmin lain perusyhtälö on V = I × R. Tämä yhtälö pätee sekä DC- että AC-piireille tasasuuntaisen vastarintayhtälön osalta. Se on perusta sähkövirtojen ja jännitteiden laskemiselle piireissä ja sen hallitseminen on välttämätöntä elektronikon työlle."
    },
    {
      "title": "19. Kirchhoffin virtalaki",
      "image": "./images/19.png",
      "text": "Kirchhoffin virtalaki (KCL) sanoo, että solmupisteeseen sisään tulevien ja sieltä ulos lähtevien virtojen summa on nolla. Virta ei voi kadota tai ilmestyä tyhjästä – se on varauksen säilymisen periaatteen soveltaminen. Tämä laki on ratkaiseva verkon analyysissä."
    },
    {
      "title": "20. Kirchhoffin jännitelaki",
      "image": "./images/20.png",
      "text": "Kirchhoffin jännitelaki (KVL) sanoo, että jännitteiden algebrallinen summa suljetussa silmukassa on nolla. Silmukan resistanssit eivät ole yhtäsuuret ja teho ei ole sama jokaisessa komponentissa. Tämä laki perustuu energian säilymisen periaatteeseen."
    },
    {
      "title": "21. Tehohäviö resistorissa",
      "image": "./images/21.png",
      "text": "Vastuksen tehohäviö lasketaan kaavalla P = V² / R, missä P on teho, V on jännite ja R on vastus. Vaihtoehtoisesti P = I² × R tai P = V × I. Vastukset muuttavat sähköenergiaa lämmöksi, ja tehohäviö määrittää, kuinka kuuma vastus kuumenee."
    },
    {
      "title": "22. Rinnankytkettyjen vastusten kokonaisvastus",
      "image": "./images/22.png",
      "text": "Kun resistoreita kytketään rinnan, kokonaisvastus lasketaan käänteisarvojen summasta: 1/R = 1/R1 + 1/R2 + 1/R3. Tämä ei ole sama kuin arvojen summa (R1 + R2 + R3) tai niiden tulo. Rinnankytkettyjen vastusten kokonaisvastus on aina pienempi kuin pienimmän vastuksen arvo."
    },
    {
      "title": "23. Jännitejaon periaate",
      "image": "./images/23.png",
      "text": "Jännitejaossa (potential divider) ulostulojännite on suoraan verrannollinen sarjakytkennän toiseen vastukseen (R2). Kaava on V_out = V_in × R2 / (R1 + R2). Jännitejaon avulla voidaan säätää jännitteitä haluttuihin tasoihin kompleksisten piirien sisällä."
    },
    {
      "title": "24. Jännitejaon esimerkki 1",
      "image": "./images/24.png",
      "text": "Kun tulosähköjännite on 10V ja resistanssit ovat R1=200Ω ja R2=300Ω, ulostulojännite R2 yli on V_out = 10V × 300 / (200 + 300) = 10V × 300 / 500 = 6V. Tämä esimerkki näyttää, kuinka jännite jakautuu vastuksien väillä."
    },
    {
      "title": "25. Jännitejaon esimerkki 2",
      "image": "./images/25.png",
      "text": "Monimutkaisemmassa esimerkissä, jossa V1=15V, V2=3V, R1=1000Ω ja R2=500Ω, voidaan laskea nettojännite ja sen jälkeen jännitejaon tulos. Tämä osoittaa, kuinka useat jännitelähteet ja vastukset voidaan yhdistää yhteen piiriin."
    },
    {
      "title": "26. Taajuus ja jaksonaika",
      "image": "./images/26.png",
      "text": "Taajuuden f ja jaksonajan T välillä on käänteinen suhde: f = 1 / T. Jos jaksonautaika on 1 sekunti, taajuus on 1 Hz. Taajuus mitataan hertseinä (Hz), ja se kertoo, kuinka monta jaksoa signaalit tekevät sekunnissa."
    },
    {
      "title": "27. Piirrosmerkit ja niiden tarkoitus",
      "image": "./images/27.png",
      "text": "Piirrosmerkkejä (circuit symbols) käytetään yhtenäiseen komponenttien esittämiseen. Ne eivät estä virran kulkua, vähennä jännitettä tai laske taajuutta – ne ovat yksinkertaisesti standardoituja tapoja piirtää komponentteja. Jokainen merkki edustaa tiettyä komponenttia, kuten vastusta, kondensaattoria tai diodia."
    },
    {
      "title": "28. Piirrosmerkkien merkitys",
      "image": "./images/28.png",
      "text": "Piirrosmerkit ovat tärkeitä suunnittelussa, koska ne mahdollistavat nopean ja yksiselitteisen kommunikoinnin insinöörien ja teknikkojen välillä. Standardisoidut merkit varmiststavat, että kuka tahansa voi lukea ja ymmärtää piirikaavioita ympäri maailmaa. Ne eivät kuitenkaan vaikuta suoraan piirin tehoon, taajuuteen tai mitoitukseen."
    },
    {
      "title": "29. Yleisiä oppimisvaikeuksia",
      "image": "./images/29.png",
      "text": "Jännitejaot (potential dividers) aiheuttavat tyypillisesti eniten hankaluuksia opiskelijoille. Johdon väri, virtalähteiden liitäntä ja komponenttien pakkaus ovat usein pienempiä ongelmia. Jännitejaon ymmärtäminen on tärkeää, koska se on keskeinen periaate jännitteen manipulointiin piireissä."
    },
    {
      "title": "30. Oppimisen jatkaminen",
      "image": "./images/30.png",
      "text": "Jos jokin aihe tuntuu epävarmalta, suositellaan materiaalien kertaamista ennen seuraavaa luentoa. Aiheita ei kannata ohittaa, koska neistä tulee pohja myöhemmälle oppimiselle. Säännöllinen harjoittelu ja kertaaminen varmistavat, että peruskäsitteet jäävät mieleesi."
    },
    {
      "title": "31. Sähköpiirin peruskomponentit käytännössä",
      "image": "./images/31.png",
      "text": "Kuva osoittaa sähköpiirin peruskomponenttien toimintaa ja niiden vuorovaikutusta. Se ei näytä vain yhden komponentin (kuten vastuksen) vastustusta, ainoastaan LED:n valaistusta tai jännitelähteen sisäistä rakennetta. Se on kattava näkemys siitä, kuinka piiri toimii kokonaisuutena."
    },
    {
      "title": "32. Piirin peruselementit",
      "image": "./images/32.png",
      "text": "Opetusmateriaaleissa esitetyt piirin peruselementit ovat jännitelähde (virran energialähde), johdotus (kuljettaa virtaa), komponentit (vastukset, LED:t, jne.) ja sulkija (kytkin virtaa ohjaavaksi). Nämä neljä elementtiä ovat jokaisen toimivan sähköpiirin rakennuspalat."
    },
    {
      "title": "33. Piirin potentiaalit",
      "image": "./images/33.png",
      "text": "Piirin potentiaalit kuvaavat jännitteitä eri pisteissä piirissä. Ne eivät kuvaa virran voimakkuutta yksittäisessä osassa, resistanssin arvon muutosta tai komponenttien fysikaalista sijaintia. Potentiaalidiagrammi näyttää, kuinka jännite muuttuu piirin eri kohdissa."
    },
    {
      "title": "34. Energian muunnokset",
      "image": "./images/34.png",
      "text": "Sähköpiireissä energia muuntuu jatkuvasti: sähköenergia muuntuu lämmöksi (vastuksissa), valoksi (LED:ssä) tai mekaaniseksi energiaksi (moottoreissa). Energia ei häviä kokonaan eikä pysy aina samana – se muuttaa muotoaan. Tämä on soveltamista energian säilymisen lakiin."
    },
    {
      "title": "35. Käytännön komponentit ja laboratoriovälineet",
      "image": "./images/35.png",
      "text": "Käytännön sähköpiirin rakentamiseen tarvitaan useita komponentteja ja välineitä: Arduino (ohjausyksikkö), breadboard (väliaikainen kytkentäalusta), voltmittari (jännitteen mittaus), vastus (sähkövirran rajoitus), LED (näkyvä indikaattori) ja kytkin (virtaa ohjataksi). Breadboardia käytetään komponenttien väliaikaiseen kytkentään ilman juottamista, mikä tekee prototypoinnista nopeaa ja helppoa."
    }
  ]
}
